## Ficheros con pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
path = "../ficheros_curso/merge/Pedidos.txt"
dt = pd.read_csv(path, sep=";")

In [3]:
dt.head()

   idpedido cliente  idempleado  idempresa  importe       pais
0     10248   WILMK           5          3    32.38  Finlandia
1     10249   TOMSP           6          1    11.61   Alemania
2     10250   HANAR           4          2    65.83     Brasil
3     10251   VICTE           3          1    41.34    Francia
4     10252   SUPRD           4          2    51.30    Belgica

In [4]:
dt.tail()

     idpedido cliente  idempleado  idempresa  importe            pais
825     11073   PERIC           2          2    24.95          Mexico
826     11074   SIMOB           7          2    18.44       Dinamarca
827     11075   RICSU           8          2     6.19           Suiza
828     11076   BONAP           4          2    38.28         Francia
829     11077   RATTC           1          2     8.53  Estados Unidos

In [5]:
dt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 830 entries, 0 to 829
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   idpedido    830 non-null    int64
 1   cliente     830 non-null    object
 2   idempleado  830 non-null    int64
 3   idempresa   830 non-null    int64
 4   importe     830 non-null    float64
 5   pais        830 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 39.0+ KB

In [6]:
dt.describe()

           idpedido  idempleado   idempresa      importe
count    830.000000  830.000000  830.000000   830.000000
mean   10662.500000    4.403614    2.008434    78.244205
std      239.744656    2.499648    0.778899   116.779294
min    10248.000000    1.000000    1.000000     0.020000
25%    10455.250000    2.000000    1.000000    13.380000
50%    10662.500000    4.000000    2.000000    41.360000
75%    10869.750000    7.000000    3.000000    91.430000
max    11077.000000    9.000000    3.000000  1007.640000

In [9]:
paises = dt.pais.value_counts()
paises[paises > 70]

pais
Estados Unidos    123
Alemania          122
Brasil             83
Francia            76
Name: count, dtype: int64

In [11]:
L = sorted(dt.pais.unique())
L

['Alemania',
 'Argentina',
 'Austria',
 'Belgica',
 'Brasil',
 'Canada',
 'Dinamarca',
 'Espanya',
 'Estados Unidos',
 'Finlandia',
 'Francia',
 'Irlanda',
 'Italia',
 'Mexico',
 'Noruega',
 'Polonia',
 'Portugal',
 'Reino Unido',
 'Suecia',
 'Suiza',
 'Venezuela']

In [14]:
dtSuiza = dt[(dt.pais=='Suiza') & (dt.importe > 100)]
dtSuiza

     idpedido cliente  idempleado  idempresa  importe   pais
7       10255   RICSU           9          3   148.33  Suiza
171     10419   RICSU           4          2   137.35  Suiza
418     10666   RICSU           7          2   232.42  Suiza
503     10751   RICSU           3          3   130.79  Suiza
510     10758   RICSU           3          3   138.17  Suiza

In [16]:
dtSuiza.to_csv("../ficheros/suiza.csv", sep=";", decimal=',', index=False)